# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на позиции с нечетным индексом.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

array = [2, 3, 5, 9, 3]
uneven = []
sum = 0
i = 0
while i < len(array):
    if i % 2 != 0:
        uneven.append(array[i])
        sum += array[i]
    i += 1
print(f'На нечетных позициях элементы {uneven}, ответ: {sum}')